import math #виводимо бібліотеку math для обчислення факторіалу
E=1*10**(-8) #обчислюємо задане значення точності
x=float(input("Enter x ")) #Просимо значення x, для якого потрібно обчислити значення функції
n=3 #Задаємо значення для степеня та факторіалу
S=0 #вводимо змінну суми послідовності
x_n=x #Записуємо в поточну змінну x_n перший член послідовності 
x_n1=(x**n)/(math.factorial(n)) #Обчислюємо значення наступного члена послідовності для n=3

while (abs(x_n1-x_n)) > E: #Запускаємо цикл, на початку якого перевіряємо значення модуля різниці наступного та поточного члена послідовності
    n=n+2 #збільшуємо значення степеня та факторіалу на 2
    S=S+x_n #Додаємо до наявної суми значення поточного члена послідовності
    x_n=x_n1 # Робимо наступний член послідовності поточним
    x_n1=(x**n)/(math.factorial(n)) # Обчислюємо наступний член послідовності
    
print("Значення функції для x= "+ str(x) +" - це:", S) #Виводимо значення функції в точці x за рекурентной формулою для обчислення члена ряду



