t=float(input("Enter minutes"))#Просимо ввести кількість хвилин
x=t%6#Обчислюємо остачу від ділення кількості хвилин на 6 
#Якщо остача знаходиться на проміжку [0;3), то говоримо, що зараз зелене світло
if 0<=x<3:
    print('Green light')
#Якщо остача знаходиться на проміжку [3;4), то говоримо, що зараз зелене світло
elif 3<=x<4:
    print('Yellow light')
#Якщо перші дві умови не виконуться, то говоримо, що зараз червоне світло(Тобто остача може знаходитися на проміжку [4;5))
else:
    print('Red light')
