#include <stdio.h>


int main()
{
    //Ініціюємо змінні 
    float t;//Змінна для запиту часу у хвилинах 
    float x;//Змінна, в якій запишемо остачу від ділення дійсного числа
    //Процес запиту кількості хвилин у користувача
    printf("Enter minutes\n");
    scanf_s("%f", &t);
    //Обчислення потрібних нам данних 
    x = t - ((int)(t / 6.0)) * 6;//Знаходимо остачу від ділення кількості хвилин на 6(t//6)
    

    if (0 <= x && x < 3)//Виставляємо умову: якщо остача на проміжку [0;3), то горить зелене світло.
        printf("Green\n");
    else if (3 <= x && x < 4)//Виставляємо умову: якщо остача на проміжку [3;4), то горить жовте світло.
        printf("Yellow\n");
    else//Інше: якщо остача не знаходиться ні на проміжку [0;3), ні на [3;4), то вона має значення з проміжкку [4;6). Горить червоне світло.
        printf("Red");
    return 0;
}